
# Выделяем существенные признаки и записываем данные в формализованном виде в список
auto = []
auto.append(["ВАЗ-2110", 2000, 196352])      # Объект
auto.append(["Лада Калина", 2010, 354854])   # Объект
auto.append(["УАЗ 31514", 1997, 650321])     # Объект
auto.append(["ВАЗ-2106", 1995, 521542])      # Объект
auto.append(["Лада Ларгус", 2019, 0])        # Объект
auto.append(["Лада Ларгус", 2018, 32750])    # Объект
auto.append(["Лада Ларгус", 2017, 75000])    # Объект

for i in auto:                               # Поиск авто с пробегом менее 100000 км
    if (i[2] < 100000):
        print(i[0], i[2])

for i in auto:                               # Поиск авто выпущеного в прошлом тысячелетии
    if (i[1] < 2000):
        print(i[0], i[1])

# ======================================================================================
"""
# Первый индекс - номер ящика: 0, 1, 2
boxes[0][0] = 1 # Координата по X для верхнего ящика
boxes[0][1] = 2 # Координата по Y для верхнего ящика
boxes[0][2] = ИЗОБРАЖЕНИЕ ЯЩИКА

boxes[1][0] = 2 # Координата по X для среднего ящика
boxes[1][1] = 3 # Координата по Y для среднего ящика
boxes[1][2] = ИЗОБРАЖЕНИЕ ЯЩИКА

boxes[2][0] = 3 # Координата по X для нижнего ящика
boxes[2][1] = 2 # Координата по Y для нижнего ящика
boxes[2][2] = ИЗОБРАЖЕНИЕ ЯЩИКА
"""